In [21]:
import pandas as pd
import numpy as np

In [22]:
df = pd.read_json("merged.json")

In [23]:
df

   A  A_x  B_x    key_x  A_y  B_y    key_y
0  1    2    2      pig    1    4      cat
1  2    3    2  rooster    2    4      dog
2  3    4    2   monkey    3    4  rooster
3  4    5    2      hen    4    4      pig
4  5    6    2      cat    5    4    human
5  6    7    2     slug    6    4     slug
6  7    8    2    human    7    4      hen

In [24]:
df.pivot(columns="key_x", values = ["A"])

         A
key_x  cat  hen human monkey  pig rooster slug
0      NaN  NaN   NaN    NaN  1.0     NaN  NaN
1      NaN  NaN   NaN    NaN  NaN     2.0  NaN
2      NaN  NaN   NaN    3.0  NaN     NaN  NaN
3      NaN  4.0   NaN    NaN  NaN     NaN  NaN
4      5.0  NaN   NaN    NaN  NaN     NaN  NaN
5      NaN  NaN   NaN    NaN  NaN     NaN  6.0
6      NaN  NaN   7.0    NaN  NaN     NaN  NaN

In [25]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

In [26]:
df.index = df.key_x

In [27]:
df.index

Index(['pig', 'rooster', 'monkey', 'hen', 'cat', 'slug', 'human'], dtype='object', name='key_x')

In [28]:
df.loc['slug']

A           6
A_x         7
B_x         2
key_x    slug
A_y         6
B_y         4
key_y    slug
Name: slug, dtype: object

In [29]:
df.pivot(columns = 'B_y')

         A A_x B_x    key_x A_y    key_y
B_y      4   4   4        4   4        4
key_x
cat      5   6   2      cat   5    human
hen      4   5   2      hen   4      pig
human    7   8   2    human   7      hen
monkey   3   4   2   monkey   3  rooster
pig      1   2   2      pig   1      cat
rooster  2   3   2  rooster   2      dog
slug     6   7   2     slug   6     slug

In [30]:
df.pivot(columns = 'B_x')

         A A_x    key_x A_y B_y    key_y
B_x      2   2        2   2   2        2
key_x
cat      5   6      cat   5   4    human
hen      4   5      hen   4   4      pig
human    7   8    human   7   4      hen
monkey   3   4   monkey   3   4  rooster
pig      1   2      pig   1   4      cat
rooster  2   3  rooster   2   4      dog
slug     6   7     slug   6   4     slug

In [31]:
data = np.array(((2,4),(1,2),(3,3),(4,4)))
data.T

array([[2, 1, 3, 4],
       [4, 2, 3, 4]])

In [32]:
cols = [['Tests','Tests','Tests','Tests'], ['Test1', 'Test2', 'Test3', 'Test4']]
arrays = zip(*cols)
colindex = pd.MultiIndex.from_tuples(arrays)

rows = [['Student', 'Student'], ['Jimmy', 'Jill']]
arrays = zip(*rows)
rowindex = pd.MultiIndex.from_tuples(arrays)

grade_book = pd.DataFrame(data.T, index=rowindex, columns = colindex)
grade_book

              Tests
              Test1 Test2 Test3 Test4
Student Jimmy     2     1     3     4
        Jill      4     2     3     4

In [33]:
grade_book.columns

MultiIndex(levels=[['Tests'], ['Test1', 'Test2', 'Test3', 'Test4']],
           labels=[[0, 0, 0, 0], [0, 1, 2, 3]])

In [34]:
grade_book.columns.levels[1]

Index(['Test1', 'Test2', 'Test3', 'Test4'], dtype='object')

In [35]:
simple = grade_book.loc["Student", "Tests"]
simple

       Test1  Test2  Test3  Test4
Jimmy      2      1      3      4
Jill       4      2      3      4